src/Documents/МыВернулиДолг/МыВернулиДолг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МыВернулиДолг</name>
  <registerRecords>AccumulationRegister.ОборотыПлановыхОпераций</registerRecords>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>АналитикаСтатьиРасходовПоКомиссии</name>
    <type>
      <types>CatalogRef.ЗначенияСубконтоАналитика</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатьиРасходовПоПроцентам</name>
    <type>
      <types>CatalogRef.ЗначенияСубконтоАналитика</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаСтатьиСписания</name>
    <type>
      <types>CatalogRef.ЗначенияСубконтоАналитика</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКошелька</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплаченоКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыплаченоКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыплаченоПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВалютыКошелька</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВалютыКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредитор</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалютыКошелька</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалютыКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаноКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПоКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПоПроцентам</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписания</name>
    <type>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДополнительныхРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредитаВВалютеКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПроцентовВВалютеКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНачисленоКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНачисленоПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСписаноПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРасходы</name>
    <attributes>
      <name>КошелекРасхода</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасхода</name>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦель</name>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаСтатьи</name>
      <type>
        <types>CatalogRef.ЗначенияСубконтоАналитика</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналитикаДокумента</name>
    <comment>Аналитика, использованная в документе</comment>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактироватьВШапке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАналитикиВШапке</name>
      <type>
        <types>Characteristic.ВидыАналитик</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/AccumulationRegisters/ФактическиеОборотыБюджета/ФактическиеОборотыБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФактическиеОборотыБюджета</name>
  <comment>Фактические обороты по статьям бюджета</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>РазделБюджета</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьяБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/МыВернулиДолг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбщегоНазначенияДеньги.ЗаполнитьОбъектПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	// Проверяем реквизиты нового документа в соответствии с настройками пользователя
	ОбслуживаниеДокументов.ПроверитьЗаполнениеНовогоДокумента(ЭтотОбъект);
	
	// Заполняем незаполненные реквизиты значениями по умолчанию:
	Если ЗначениеЗаполнено(Кредит) И НЕ ЗначениеЗаполнено(Кредитор) Тогда
		Кредитор = Кредит.Контакт;
	КонецЕсли;
	Если ЗначениеЗаполнено(Кредит) И НЕ ЗначениеЗаполнено(ВалютаКредита) Тогда
		ВалютаКредита = Кредит.Валюта;
	КонецЕсли;
	Если ЗначениеЗаполнено(Кошелек) И НЕ ЗначениеЗаполнено(ВалютаКошелька) Тогда
		ВалютаКошелька = Кошелек.Валюта;
	КонецЕсли;
	Если ЗначениеЗаполнено(Кошелек) И Кошелек.ИспользоватьДляНакоплений И НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = Справочники.ФинансовыеЦели.ОбщиеНакопления;
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если ВалютаКредита = ВалютаУчета ИЛИ НЕ ЗначениеЗаполнено(ВалютаКредита) Тогда
		КурсВалютыКредита      = 1;
		КратностьВалютыКредита = 1;
	Иначе
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаКредита, Дата, ВалютаУчета);
		КурсВалютыКредита      = Макс(КурсИКратность.Курс, 1);
		КратностьВалютыКредита = Макс(КурсИКратность.Кратность, 1);;
	КонецЕсли; 
	Если ВалютаКошелька = ВалютаУчета ИЛИ НЕ ЗначениеЗаполнено(ВалютаКошелька) Тогда
		КурсВалютыКошелька      = 1;
		КратностьВалютыКошелька = 1;
	Иначе
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаКошелька, Дата, ВалютаУчета);
		КурсВалютыКошелька      = Макс(КурсИКратность.Курс, 1);
		КратностьВалютыКошелька = Макс(КурсИКратность.Кратность, 1);;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Общий функционал документов:
	ОбщегоНазначенияДеньги.ОбработкаСобытияПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если ВалютаКредита = ВалютаУчета ИЛИ НЕ ЗначениеЗаполнено(ВалютаКредита) Тогда
		КурсВалютыКредита      = 1;
		КратностьВалютыКредита = 1;
	Иначе
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаКредита, Дата, ВалютаУчета);
		КурсВалютыКредита      = Макс(КурсИКратность.Курс, 1);
		КратностьВалютыКредита = Макс(КурсИКратность.Кратность, 1);;
	КонецЕсли; 
	Если ВалютаКошелька = ВалютаУчета ИЛИ НЕ ЗначениеЗаполнено(ВалютаКошелька) Тогда
		КурсВалютыКошелька      = 1;
		КратностьВалютыКошелька = 1;
	Иначе
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаКошелька, Дата, ВалютаУчета);
		КурсВалютыКошелька      = Макс(КурсИКратность.Курс, 1);
		КратностьВалютыКошелька = Макс(КурсИКратность.Кратность, 1);;
	КонецЕсли; 
	
	Если ОбъектКопирования.ЭтоШаблон Тогда
		ОписаниеОперации = НСтр("ru = 'Копия'") + ": " + ОбъектКопирования.ОписаниеОперации; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если СписаноКредита = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяСписания");
	КонецЕсли;
	
	Если ВыплаченоКомиссии = 0 И ВыплаченоКредита = 0 И ВыплаченоПроцентов = 0 И ДополнительныеРасходы.Итог("СуммаРасхода") = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Кошелек");
	КонецЕсли; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполнение итоговых и информационных реквизитов:
	Документы.МыВернулиДолг.ОбновитьИтоговыеСуммыДокумента(ЭтотОбъект);
	
	ВалютаОперации = ?(ЗначениеЗаполнено(Кредит), Кредит.Валюта, Константы.ВалютаУчета.Получить());
	
	ВалютаКредита  = Кредит.Валюта;
	ВалютаКошелька = Кошелек.Валюта;
	Для Каждого СтрокаРасхода Из ДополнительныеРасходы Цикл
		СтрокаРасхода.КошелекРасхода = Кошелек;
	КонецЦикла; 

	// Проверяем корректность заполнения финансовой цели в шапке и в табличной части Доп.расходы
	КошелекДляНакоплений = ЗначениеЗаполнено(Кошелек) И Кошелек.ИспользоватьДляНакоплений;
	Если ЗначениеЗаполнено(ФинансоваяЦель) И Не КошелекДляНакоплений Тогда
		ФинансоваяЦель = Неопределено;
	Иначе
		ФинансоваяЦель = ?(ЗначениеЗаполнено(ФинансоваяЦель), ФинансоваяЦель, Справочники.ФинансовыеЦели.ОбщиеНакопления);
	КонецЕсли;
	Для каждого Строка Из ДополнительныеРасходы Цикл
		Если ЗначениеЗаполнено(Строка.ФинансоваяЦель) И Не КошелекДляНакоплений Тогда
			Строка.ФинансоваяЦель = Неопределено;
		Иначе
			Строка.ФинансоваяЦель = ?(ЗначениеЗаполнено(Строка.ФинансоваяЦель), Строка.ФинансоваяЦель, Справочники.ФинансовыеЦели.ОбщиеНакопления);
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем корректность пересчета сумм
	Если ВыплаченоПроцентов <> 0 И СуммаПроцентовВВалютеКредита = 0 Тогда
		Если ВалютаКошелька = ВалютаКредита Тогда
			СуммаПроцентовВВалютеКредита = ВыплаченоПроцентов;
		Иначе
			СуммаПроцентовВВалютеКредита = РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыплаченоПроцентов, ВалютаКошелька, ВалютаКредита, Дата);
		КонецЕсли;
	КонецЕсли;
	
	Если ВалютаКошелька = ВалютаКредита И СуммаКредитаВВалютеКредита <> ВыплаченоКредита Тогда
		СуммаКредитаВВалютеКредита = ВыплаченоКредита;
	КонецЕсли;
	
	
	// Заполняем итоговые суммы операции
	СуммаДополнительныхРасходов = ДополнительныеРасходы.Итог("СуммаРасхода");
	Если ВыплаченоКредита <> 0 ИЛИ ВыплаченоПроцентов <> 0 Тогда
		СуммаОперации  = ВыплаченоКредита + ВыплаченоПроцентов + ВыплаченоКомиссии + СуммаДополнительныхРасходов;
		ТипИтога = "Списание";
	Иначе
		СуммаОперации  = СуммаПроцентовВВалютеКредита + ВыплаченоКомиссии;
		ТипИтога = "Начисление";
	КонецЕсли; 
	
	Если ЭтоШаблон Тогда
		Проведен = Ложь;
		Если РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТипИтога = "Начисление" Тогда
		ОписаниеОперации = НСтр("ru = 'Начисления % по долгу [%1]'"); 
	Иначе
		ОписаниеОперации = НСтр("ru = 'Мы вернули долг (кредит) [%1]'"); 
	КонецЕсли; 
	ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОперации, Кредит);
	
	Если ДополнительныеРасходы.Количество() > 0 Тогда
		СписокРасходов = ДополнительныеРасходы.Выгрузить(,"СтатьяРасхода");
		СписокРасходов.Свернуть("СтатьяРасхода");
		ОписаниеРасходов = "";
		Для Каждого СтрокаРасхода Из СписокРасходов Цикл
			Если ЗначениеЗаполнено(СтрокаРасхода.СтатьяРасхода) Тогда
				ОписаниеРасходов = ОписаниеРасходов + ?(ОписаниеРасходов = "", "", ", ") + СтрокаРасхода.СтатьяРасхода;
			КонецЕсли; 
		КонецЦикла; 
		Если ЗначениеЗаполнено(ОписаниеРасходов) Тогда
			ОписаниеОперации = ОписаниеОперации + ". " + НСтр("ru = 'Доп. расходы'") + ": " + ОписаниеРасходов;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ОписаниеОперации = ОписаниеОперации + " (" + Комментарий + ")";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем дополнительные реквизиты информацией, необходимой для формирования записей в регистры
	Документы.МыВернулиДолг.ПроверитьДополнительныеСвойстваОперации(ЭтотОбъект, ДополнительныеСвойства, Истина);
	ОбслуживаниеДокументов.ПриЗаписиОбъектаДокумента(ЭтотОбъект);
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка ИЛИ ЭтоШаблон Тогда
		Возврат;
	КонецЕсли; 
	
	Документы.МыВернулиДолг.СформироватьДвиженияДокумента(Ссылка, Движения, ДополнительныеСвойства);
	ПлановыеОперации.ПроверитьОборотыПлановойОоперацииПриПроведении(ЭтотОбъект);
	
	Движения.ЖурналОпераций.Записывать            = Истина;
	Движения.ФактическиеОборотыБюджета.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти



#КонецЕсли
